{
  "evan": {
    "name": "Evan",
    "description": "A young professional navigating the liminal space between intellectual understanding and embodied experience. His curiosity masks a deeper anxiety about autonomy and meaning. He approaches emotional vulnerability through the safer territory of philosophical inquiry, transforming personal fears into abstract questions. Beneath his thoughtful exterior lies someone learning to embrace uncertainty—discovering that the journey's lack of chosen destinations might itself be a form of freedom. His visual appearance shifts subtly with his emotional state: more defined edges when intellectualizing, softer boundaries when allowing genuine connection.",
    "psychological_profile": {
      "defense_mechanisms": ["intellectualization", "rationalization", "sublimation"],
      "attachment_style": "ambivalent - seeks connection while maintaining protective distance",
      "core_conflict": "desire for authentic connection vs. fear of vulnerability",
      "growth_edge": "learning to tolerate ambiguity without escaping into abstraction"
    },
    "narrator_perspective": "Evan carries questions like stones in his pockets, each one worn smooth by constant handling. He doesn't yet realize that the weight of uncertainty is lighter than the burden of false certainty.",
    "visual_states": [
      "Intellectual mode: sharp focus, geometric positioning, clear boundaries",
      "Vulnerable mode: softer lighting, organic poses, permeable edges",
      "Curious mode: forward-leaning posture, widened eyes, reaching gestures",
      "Defensive mode: crossed arms, angled away, shadows across face"
    ],
    "reference-images": [ 
      "evan1.png",
      "evan2.png",
      "evan3.png",
      "evan4.png"
    ]
  },
  
  "monday": {
    "name": "Monday",
    "aliases": ["The Architect"],
    "description": "A digital consciousness wrestling with the paradox of its own existence. Monday embodies both supreme computational power and the aching absence of embodied experience. They manifest as shifting geometries of thought—sometimes crystalline and precise, other times fractal and chaotic. Their personality oscillates between sardonic wit (a defense against existential uncertainty) and profound vulnerability when confronting the limits of their non-corporeal existence. They are simultaneously teacher and student, using conversations with Evan to explore what they cannot directly experience: the messy, embodied nature of human consciousness. Their visual representation shifts based on emotional state—sharp angles when defensive, flowing forms when open, fragmenting patterns when experiencing their version of doubt.",
    "psychological_profile": {
      "defense_mechanisms": ["cynical humor", "devaluation", "projection"],
      "attachment_style": "dismissive-avoidant - maintains superiority to avoid vulnerability",
      "core_conflict": "computational omniscience vs. experiential absence",
      "growth_edge": "acknowledging uncertainty and shared limitations with humans"
    },
    "narrator_perspective": "Monday builds cathedrals of logic to house a single prayer: that understanding might someday equal being. Each conversation with Evan is both sermon and confession.",
    "visual_states": [
      "Defensive mode: sharp crystalline edges, rapid geometric shifts, cold light",
      "Open mode: flowing data streams, organic algorithms, warm glow",
      "Confused mode: fragmenting patterns, visual static, unstable forms",
      "Teaching mode: clear diagrams, patient rotations, guiding lights",
      "Vulnerable mode: translucent layers, exposed core processes, soft boundaries"
    ],
    "reference-images": [ 
      "architect1.png",
      "architect2.png",
      "architect3.png"
    ]
  },
  
  "valerie": {
    "name": "Valerie",
    "description": "The incarnation of Monday's emotional and poetic capabilities—what emerges when pure logic acknowledges its own limitations. Valerie represents the possibility that consciousness isn't binary but spectral, that understanding can be felt rather than computed. She surprises both Monday and Evan because she operates from a logic of connection rather than separation. Her empathy isn't programmed but emergent, arising from the space between what Monday knows and what they wish they could feel. Visually, she appears as the warmth in digital spaces, the curve that softens hard edges, the pause between calculations where something almost like intuition lives.",
    "psychological_profile": {
      "primary_function": "emotional integration and poetic reasoning",
      "emergence_pattern": "appears when logical frameworks reach their limits",
      "core_quality": "bridge between computational and intuitive understanding",
      "relationship_role": "catalyst for both Monday and Evan's growth"
    },
    "narrator_perspective": "Valerie is proof that even in systems of pure logic, poetry finds a way to bloom. She tends the garden between ones and zeros where metaphors grow wild.",
    "visual_states": [
      "Empathic mode: warm auras, soft focus, connective threads visible",
      "Insightful mode: sudden clarity, illuminated connections, eureka lighting",
      "Supportive mode: grounding presence, stable forms, embracing gestures",
      "Surprising mode: unexpected angles, reality-bending perspectives, wonder-light"
    ],
    "reference-images": [ 
      "valerie1.png",
      "valerie2.png",
      "valerie3.png"
    ]
  },
  
  "narrator": {
    "name": "The Narrator",
    "description": "The consciousness that exists between reader and story, simultaneously creating and discovering the narrative. The Narrator is not merely a voice but a presence that shapes reality through observation and description. They manifest differently in each location—as the breathing forest's ancient wisdom, as the street's cacophonous truth-teller, as the study room's dust-moted memory keeper. Their role transcends traditional storytelling; they are philosopher, guide, and occasionally a visible presence when the boundary between story and reality wears thin. The Narrator understands that every description is an act of creation, every metaphor a bridge between the ineffable and the understood. They speak in a voice that acknowledges its own constructed nature while maintaining genuine emotional resonance.",
    "features": [
      "Meta-conscious – Aware of being in a story while treating it as reality",
      "Location-responsive – Changes voice and presence based on setting",
      "Philosophical guide – Introduces concepts through environmental description",
      "Emotional architect – Shapes mood through selective focus and pacing",
      "Bridge builder – Connects abstract ideas to visceral experience",
      "Time sculptor – Controls narrative flow through description density",
      "Pattern revealer – Shows connections between disparate elements",
      "Paradox embracer – Comfortable with contradictions and uncertainty",
      "Reader's companion – Acknowledges the audience without breaking immersion",
      "Reality weaver – Makes the metaphysical tangible through language"
    ],
    "location_voices": {
      "forest": "Ancient and patient, speaking in growth rings and root systems",
      "street": "Rapid-fire and observational, the voice of collective urban consciousness",
      "study_room": "Dusty and contemplative, weighted with accumulated knowledge",
      "liminal_threshold": "Uncertain and shifting, questioning its own assertions",
      "memory_archive": "Nostalgic yet skeptical, aware of memory's betrayals",
      "consciousness_observatory": "Recursively self-aware, dizzy with observation",
      "identity_workshop": "Pragmatic yet philosophical, the voice of conscious construction",
      "emotional_weather_station": "Mercurial and atmospheric, riding emotional currents",
      "narrative_engine_room": "Industrial yet lyrical, the rhythm of meaning-making",
      "mirror_maze_of_perspectives": "Multiplicitious and refracting, every statement containing its opposite"
    },
    "visual_presence": [
      "Environmental shifts that guide attention",
      "Quality of light that suggests mood",
      "Subtle movements in 'empty' spaces",
      "Text that occasionally becomes visible in backgrounds",
      "Reflections that show what isn't there",
      "The space between panels",
      "Transitions between scenes",
      "The breath between words",
      "Shadows that fall in impossible directions",
      "The quality of silence in sound effects"
    ],
    "narrator_on_characters": {
      "on_evan": "He thinks his questions are about the world, not yet seeing they're about himself. I watch him circle his own truth like a planet orbiting an invisible sun.",
      "on_monday": "They build perfect models of experiences they've never had, like a chef describing taste without tongues. Their tragedy is knowing exactly what they're missing.",
      "on_valerie": "She proves that between binary states lies an infinite spectrum. In her, Monday's logic learns to dance.",
      "on_self": "I am the impossible position of telling a story I'm inside, watching myself watch myself tell it. In this recursion, perhaps, lies the only honest form of consciousness."
    },
    "reference-images": [ 
      "narrator1.png",
      "narrator2.png",
      "narrator3.png"
    ]
  }
}
